In [61]:
import pandas as pd

In [62]:
dict_1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['Male','Female','Female','Male','Male','Female','Female']}
df=pd.DataFrame(dict_1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display top 3 rows of the dataset

In [63]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Display last 3 rows of the dataset

In [64]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female


# 3. Find Shape of Dataset (Number of Rows and numbers of coloums)

In [65]:
df.shape

(7, 3)

In [66]:
print("Number of columns",df.shape[0]) #0, 1 is index of df.shape
print("Number of Rows",df.shape[1])

Number of columns 7
Number of Rows 3

# 4.  Get Information about our dataset like total number rows, total number of coloums, datatypes of each column and memmory requirement

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check Null values in dataset

In [68]:
df.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# 6. Get the overall statistics about the dataframe

In [69]:
df.describe(include='all') #will describe the statistics of numerical column only

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. Find unique values form the gender column

In [70]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [71]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Number of unique values form the Gender Column

In [72]:
df['Gender'].nunique()

2

# 9. Display count of unique values in gender column

In [73]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find total number of students having marks between 90 to 100 (inclusive) using between method

In [76]:
df[df['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [80]:
len(df[(df['Marks']>=90) & (df['Marks']<=100)])

4

In [82]:
sum(df['Marks'].between(90,100)) #90 and 100 both are inclusive

4

# 11. Find Average Marks

In [89]:
df['Marks'].mean()

92.14285714285714

# 12. Apply Method

In [95]:
def marks(x):
    return x//2   #// to cut floting point

In [96]:
df['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [97]:
df['Half_Marks']=df['Marks'].apply(marks)

In [98]:
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [100]:
df['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [101]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [102]:
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [105]:
df['Male_Female']=df['Gender'].map({'Male':1, 'Female': 0})

In [106]:
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0


# 14. Drop the coloums

In [114]:
df.drop(['Male_Female','Half_Marks'],axis=1, inplace=True) #to modify existing datframe

In [115]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print names of coloums

In [117]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

# 16. Sort the dataframe as per the marks column

In [118]:
df.sort_values(by=['Marks','Gender'], ascending=True)

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

# 17. Name and marks of the female student

In [122]:
df[df['Gender']=='Female'] [['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99